soap-with-xsd/wsdl/CountryInfoService.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions
   xmlns:xs="http://www.w3.org/2001/XMLSchema"
   xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
   xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/"
   xmlns:tns="http://www.oorsprong.org/websamples.countryinfo"
   xmlns:types="http://www.oorsprong.org/websamples.countryinfo"
   xmlns:taxi="http://taxilang.org/"
   xmlns="http://schemas.xmlsoap.org/wsdl/"
   name="CountryInfoService"
   targetNamespace="http://www.oorsprong.org/websamples.countryinfo">

   <types>
      <xs:schema elementFormDefault="qualified">
         <!-- Import the schema containing the type definitions -->
         <xs:import namespace="http://www.oorsprong.org/websamples.countryinfo"
                    schemaLocation="country-info-types.xsd"/>
      </xs:schema>
   </types>

   <message name="FullCountryInfoSoapRequest">
      <part name="parameters" element="types:FullCountryInfo"/>
   </message>

   <message name="FullCountryInfoSoapResponse">
      <part name="parameters" element="types:FullCountryInfoResponse"/>
   </message>

   <portType name="CountryInfoServiceSoapType">
      <operation name="FullCountryInfo">
         <documentation>Returns a struct with all stored country information. Pass the ISO country code.</documentation>
         <input message="tns:FullCountryInfoSoapRequest"/>
         <output message="tns:FullCountryInfoSoapResponse"/>
      </operation>
   </portType>

   <binding name="CountryInfoServiceSoapBinding" type="tns:CountryInfoServiceSoapType">
      <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
      <operation name="FullCountryInfo">
         <soap:operation soapAction="" style="document"/>
         <input><soap:body use="literal"/></input>
         <output><soap:body use="literal"/></output>
      </operation>
   </binding>

   <binding name="CountryInfoServiceSoapBinding12" type="tns:CountryInfoServiceSoapType">
      <soap12:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
      <operation name="FullCountryInfo">
         <soap12:operation soapAction="" style="document"/>
         <input><soap12:body use="literal"/></input>
         <output><soap12:body use="literal"/></output>
      </operation>
   </binding>

   <service name="CountryInfoService">
      <documentation>This service provides country information. ISO codes are used for lookup.</documentation>
      <port name="CountryInfoServiceSoap" binding="tns:CountryInfoServiceSoapBinding">
         <soap:address location="http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso"/>
      </port>
      <port name="CountryInfoServiceSoap12" binding="tns:CountryInfoServiceSoapBinding12">
         <soap12:address location="http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso"/>
      </port>
   </service>

</definitions>
